_posts/2016-08-16-docker.html
---
layout: page
title: Docker
date: 2016-08-16
category: reproduce
permalink: reproduce/docker
---

<p>
I provide the full environment used for all computations referenced in the article in form of Docker image. In short, <a href="https://www.docker.com/">Docker</a> uses virtualization on the operating system level to provide "containers" for Linux applications and has been &#x2013;Boettinger<br  />
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Docker image</h2>
<div class="outline-text-2" id="text-1">
<p>
The Docker image used for this project is <code>felix11h/aniso_netw_env</code> and is available on <a href="https://hub.docker.com/r/felix11h/aniso_netw_env/">Docker Hub</a>. A short list of the most important dependencies included in this image are<br  />
</p>

<ul class="org-ul">
<li>Python<br  />
</li>
<li>scipy<br  />
</li>
<li>Graph Tool<br  />
</li>
<li>tex-live<br  />
</li>
<li><a href="http://neuralensemble.org/sumatra/">Sumatra</a> 0.7<br  />
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Accessing the Docker container</h2>
<div class="outline-text-2" id="text-2">
<p>
The computational environment can be most easily accessed using the provided bash script <code>access_lab.sh</code>. In the directory,<br  />
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #6c71c4;">source</span> access_lab.sh
</pre>
</div>
<p>
to start the container. The image <code>felix11h/aniso_netw_env</code> will be downloaded automatically if it's not available on your machine already (this will take some time and around 5 GB of disk space!).<br  />
</p>

<p>
In your terminal you should now see something along the lines of<br  />
</p>

<div class="org-src-container">

<pre class="src src-sh">docker@c30441c7f888:/home/lab$
</pre>
</div>

<p>
indicating that you've successfully started the container and have now access to all of the tools listed above. You can now access the lab notebook through the <a href="http://anisotropic-connectivity-local-circuits.github.io/reproduce/sumatra">Sumatra</a> web interface.<br  />
</p>
</div>
</div>
